#include <iostream>

void F(int numb) {
    std::string tens[20] = { "","один","два","три","четыре","пять","шесть","семь","восемь","девять","десять","одиннадцать",
        "двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать" };
    std::string tens2[10] = { "","","двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто" };
    std::string hundreds[10] = { "","сто","двести","триста","четыреста","пятьсот","шестьсот","семьсот","восемьсот","девятьсот" };
    if (numb != 0) {
        std::cout << hundreds[numb / 100] << " ";
    }
    if (numb % 100 > 19) {
        std::cout << tens2[(numb / 10)%10] << " ";
        std::cout << tens[numb % 10] << " ";
    }
    else {
        std::cout << tens[numb % 100] << " ";
    }
}

int main() {
    int n, x;
    std::cin >> n;
    setlocale(LC_ALL, "Russian");
    if (n == 1000000000) {
        std::cout << "один миллиард";
        n = 0;
    }
    x = (n / 1000000);
    n = n % 1000000;
    if (x != 0) {
        F(x);
        if ((x % 100 > 19) || (x % 100 < 10)) {
            if (x % 10 == 1) {
                std::cout << "миллион" << " ";
            }
            else if ((x % 10 == 2) || (x % 10 == 3) || (x % 10 == 4)) {
                std::cout << "миллиона" << " ";
            }
            else {
                std::cout << "миллионов" << " ";
            }
        }
        else {
            std::cout << "миллионов" << " ";
        }
    }
    x = n / 1000;
    n = n % 1000;
    if (x != 0) {
        if ((x % 100 > 19) || (x % 100 < 10)) {
            if (x % 10 == 1) {
                --x;
                F(x);
                std::cout << "одна тысяча" << " ";
            }
            else if (x % 10 == 2) {
                x -= 2;
                F(x);
                std::cout << "две тысячи" << " ";
            }
            else if ((x % 10 == 3) || (x % 10 == 4)) {
                F(x);
                std::cout << "тысячи" << " ";
            }
            else {
                F(x);
                std::cout << "тысяч" << " ";
            }
        }
        else {
            F(x);
            std::cout << "тысяч" << " ";
        }
    }
    F(n);
    return 0;
}
